app/Controllers/Spj.php

    public function list()
    {
        if ($resp = $this->requireStaff()) return $resp;

        $spjModel = new ModelSpj();
        $dataSpj  = $spjModel
            ->where('id_user', session()->get('user_id'))
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `t_spj`
WHERE `id_user` = '3'
ORDER BY `created_at` DESC